// 本地番剧数据配置
export interface AnimeItem {
	title: string;
	status: "watching" | "completed" | "planned";
	rating: number;
	cover: string;
	description: string;
	episodes: string;
	year: string;
	genre: string[];
	studio: string;
	link: string;
	progress: number;
	totalEpisodes: number;
	startDate: string;
	endDate: string;
}

const localAnimeList: AnimeItem[] = [
	{
    "title": "一人之下 第六季",
    "status": "watching",
    "rating": 6.6,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/ee/ae/507819_OD5zd.jpg",
    "description": "张楚岚在碧游村事件后，继续帮冯宝宝查找身世，因此他拜访了陆瑾。张楚岚从陆瑾处拿到了三十六贼的名单，并意外得知了金凤被掳走的原因。为了让无根生的藏品不落入贼人之手，一行人开始朝着秦岭山深处的二十四谷出发….",
    "episodes": "26 episodes",
    "year": "2026",
    "genre": [
      "国产",
      "漫画改",
      "战斗"
    ],
    "studio": "总制作：北京启缘映画文化传播有限公司、上海一魁夺动漫文化传播有限公司",
    "link": "https://bgm.tv/subject/507819",
    "progress": 17,
    "totalEpisodes": 26,
    "startDate": "2026-01-02",
    "endDate": "2026-01-02"
  },
  {
    "title": "和班上第二可爱的女孩成为朋友",
    "status": "watching",
    "rating": 5.8,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/13/2a/456079_4171E.jpg",
    "description": "在班上是边缘人的前原真树，交到了人生第一个朋友──朝凪海。她总是站在圈子中心，还被其他男生私下传说是「班上第二可爱」的女生。本以为她和我这种边缘人根本不是同一个世界的人──没想到……？系列累计突破130万册！阴影男与「第二女主角」，最贴近真实的「朋友」恋爱喜剧开幕\r\n\r\n\r\n\r\n[简介原文]\r\nクラスでぼっちな前原真樹に、初めてできた友だち・朝凪海。いつも輪の中心にいて、他の男子からは『クラスで2番目に可愛い』なんて陰で噂されている。ぼっちの自分なんかとは住む世界が違う──と思いきや、、、シリーズ累計100万部突破！日陰男子と2番目ヒロイン、等身大の“友だち”ラブコメ開幕!!",
    "episodes": "12 episodes",
    "year": "2026",
    "genre": [
      "恋爱",
      "2026年4月",
      "校园"
    ],
    "studio": "クラにか製作委員会（アスミック・エース、日本コロムビア、関西テレビ放送、KADOKAWA、BS朝日、ビットグルーヴプロモーション、クロックワークス）",
    "link": "https://bgm.tv/subject/456079",
    "progress": 0,
    "totalEpisodes": 12,
    "startDate": "2026-04-07",
    "endDate": "2026-04-07"
  },
  {
    "title": "欢迎来到实力至上主义教室 第四季",
    "status": "watching",
    "rating": 6.2,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/43/46/510710_rHO8M.jpg",
    "description": "东京都高度育成高等中学，标榜升学率、就职率达百分之百，而且每个月会提供相当于十万圆金钱的点数，是一间梦幻学校。但其实是一间只有少部分成绩优秀的人，才拥有优良待遇的实力至上主义学校。\r\n绫小路等人在一年级第三学期升上C班，但最后一场特别考试却惜败A班，再度降格D班。二年级将从D班重新起跑。春假过后，绫小路和轻井泽成为男女朋友，堀北则是与憧憬学这个优秀兄长的自己诀别。在人际关系渐渐产生变化的情况下，他们升上二年级。绫小路他们新二年级生的第一场特别考试，是与新生一组进行笔试。然而，新生中有月城找来的White room刺客混入其中——\r\n跨越学年的新关系，将招来狂风暴雨还是风平浪静？第二年的学校生活现在拉开序幕。\r\n\r\n\r\n[简介原文]\r\n東京都高度育成高等学校、それは進学率・就職率100％を誇り、毎月10万円の金銭に相当するポイントが支給される夢のような学校。しかし、その内実は一部の成績優秀者のみが好待遇を受けられる実力至上主義の学校であった。1年生3学期にCクラスへと昇格した綾小路たちだったが、1学年最終特別試験の結果、Aクラスに惜敗し、再びDクラスへと降格。2年生はDクラスからの再スタートとなった。春休みを経て、綾小路は軽井沢と恋人関係となり、堀北は優秀な兄・学にあこがれていた自分と決別。少しずつ人間関係が変化する中で、2年生へと進級する。綾小路たち新2年生の最初の特別試験は、新入生とパートナーを組んで行う筆記試験。しかし、新入生の中には、月城が手配したホワイトルームからの刺客が紛れており──。学年を超えた新たな関係が呼ぶのは、嵐か凪か。2年目の学校生活の幕が今、切って落とされる。",
    "episodes": "16 episodes",
    "year": "2026",
    "genre": [
      "2026年4月",
      "校园",
      "轻小说改"
    ],
    "studio": "ようこそ実力至上主義の教室へ4製作委員会（KADOKAWA、Crunchyroll、AT-X、バンダイナムコミュージックライブ、サミー、ムービック、BS日本、スタジオ雲雀）",
    "link": "https://bgm.tv/subject/510710",
    "progress": 7,
    "totalEpisodes": 16,
    "startDate": "2026-04-01",
    "endDate": "2026-04-01"
  },
  {
    "title": "败犬女主太多了！",
    "status": "completed",
    "rating": 8,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/e4/dc/464376_NsZRw.jpg",
    "description": "没能赢得心上人恋情的女孩——“败犬女主”。\r\n爱吃的青梅竹马系女主·八奈见杏菜。\r\n活力充沛的运动系女主·烧盐柠檬。\r\n怕生的小动物系女主·小鞠知花。\r\n被有点缺憾的败犬女主——败女们环绕，新感觉、乱糟糟的败走系青春故事就此揭幕。\r\n因失败而更加闪耀吧，败女们！",
    "episodes": "12 episodes",
    "year": "2024",
    "genre": [
      "恋爱",
      "校园",
      "A-1Pictures"
    ],
    "studio": "マケイン応援委員会（Aniplex、日本BS放送、TOKYO MX、Good Smile Company、コンテンツシード、JR東海エージェンシー）；製作协力：三宅将典、西本修、高橋祐馬、岡田武士、松﨑由美子、谷池侑美、中田博也、吉田剛志、冨田功一郎、新倉俊哉、小亀淳一、杉山裕哉、水野義也、楠根史晃、柳原徹也、佐藤茂薫、月岡佑紀、佐藤顕",
    "link": "https://bgm.tv/subject/464376",
    "progress": 0,
    "totalEpisodes": 12,
    "startDate": "2024-07-13",
    "endDate": "2024-07-13"
  },
  {
    "title": "魔术师库诺看得见一切",
    "status": "completed",
    "rating": 5.8,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/31/38/534674_alb5D.jpg",
    "description": "在遥远的过去，人类曾与魔王爆发一场大战，最终由英雄击败了魔王。\r\n然而，自那之后，在英雄的后裔之中，偶尔会诞生出「缺少某样东西」的孩子，人们将此称为──「英雄的伤痕」。\r\n\r\n而这个故事，就是讲述着因为英雄的伤痕，从出生起就双目失明的少年库诺・古里翁。\r\n世人向他的诞生献上祝福，但身处无尽黑暗中的他，却逐渐封闭了自己的内心。寄宿着「水之纹章」的库诺，迎来了教授水魔术的家庭教师──洁尼・寇斯。而她一句看似随口的话，彻底改变了库诺的人生。\r\n\r\n「我想想，应该差不多跟眼球一样大吧？」\r\n「…对啊，那就用水魔术为自己做出一双眼睛不就好了吗！？」\r\n\r\n从此之后，库诺的人生目标，就是用水系魔术为自己创造一双全新的眼睛。仅仅经过五个月的魔术练习，库诺的实力便已经超越了自己的老师，其才华也随着这场前所未有的魔术挑战逐渐显现。\r\n从透过魔力感知周遭的色彩、用水魔术做出暖手设备和湿巾，直到只用初级魔术再现出一只小猫……其技术与构思，库诺那出众的技能与想象力令宫廷魔法师都为之乍舌，由此他的实力也得到认可，成为了最强魔法师的弟子！？\r\n\r\n以好奇心开拓世界的天才少年物语，此刻揭开序幕！\r\n\r\n目の見えない少年クノンの目標は、水魔術で新たな目を作ること。\r\n魔術を習い始めて僅か五ヵ月で教師の実力を追い越したクノンは、その史上初の挑戦の中でさらに才能を開花させていく…\r\n好奇心で世界を切り拓く、盲目の天才少年の魔術探求ファンタジー、開幕。",
    "episodes": "13 episodes",
    "year": "2026",
    "genre": [
      "2026年1月",
      "奇幻",
      "异世界"
    ],
    "studio": "「魔術師クノンは見えている」製作委員会（スカパー・ピクチャーズ、REMOW 、arma bianca、ぴあ、ポニーキャニオン 、読売テレビエンタープライズ、ハピネットファントム・スタジオ、ビットグルーヴプロモーション、BS朝日）；植田恭輔、佐野真之、山下真平、福島毅、菊地公一",
    "link": "https://bgm.tv/subject/534674",
    "progress": 0,
    "totalEpisodes": 13,
    "startDate": "2026-01-04",
    "endDate": "2026-01-04"
  },
  {
    "title": "我们不可能成为恋人！绝对不行。 (※似乎可行？)",
    "status": "completed",
    "rating": 10,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/ae/03/524707_1quxk.jpg",
    "description": "「勝ち取るんだ最高の学園生活を！」 \r\n\r\nぼっちな中学生時代から変わるため、高校デビューを果たした甘織れな子。しかし根が陰キャ気質のせいで、憧れの陽キャ生活に馴染めず窒息寸前に…。 \r\n\r\n現役モデルの完璧美少女、王塚真唯\r\n優しくてふわふわ天使の、瀬名紫陽花\r\nいつもクールな黒髪美人、琴紗月\r\n賑やかなムードメーカー、小柳香穂\r\n\r\n憧れの人たちに近づくために、きょうもがんばる甘織れな子。\r\nだったはずが──。 \r\n\r\n「君に恋をしてしまったんだ…」\r\n「待って！　友達どこいった！？」 \r\n\r\n友達？　恋人？　\r\n\r\n揺れ動く気持ちの間で、笑い、悩み、そして進め！　乙女たち。\r\nノンストップ・青春ガールズラブコメディ、ここに開幕！\r\n\r\n\r\n\r\n[中文简介]\r\n「我要赢得最棒的校园生活！」\r\n为了摆脱孤单的国中生活，甘织玲奈子在高中成功华丽出道。然而因为天生个性阴沉的关系，让她无法适应梦寐以求的阳角生活。\r\n\r\n现役模特儿的完美美少女－「王冢真唯」\r\n温柔得像软绵绵的天使－「濑名紫阳花」\r\n总是冷静沉着的黑发美女－「琴纱月」\r\n活泼开朗的开心果－「小柳香穗」\r\n\r\n为了靠近憧憬的人们，甘织玲奈子今天也努力不懈。\r\n──本该如此。\r\n\r\n「我已经喜欢上妳了……」\r\n「等一下！说好的朋友关系呢？」\r\n\r\n在摇摆不定的心情之间，时而欢笑、时而烦恼，然后向前迈进吧！少女们。\r\n节奏明快的青春校园百合喜剧，现在热闹开幕！",
    "episodes": "12 episodes",
    "year": "2025",
    "genre": [
      "百合",
      "后宫",
      "校园"
    ],
    "studio": "わたなれ製作委員会（集英社DeNAプロジェクツ、集英社、REMOW）",
    "link": "https://bgm.tv/subject/524707",
    "progress": 0,
    "totalEpisodes": 12,
    "startDate": "2025-07-07",
    "endDate": "2025-07-07"
  },
  {
    "title": "我们不可能成为恋人！绝对不行。 (※似乎可行？) 〜再次闪耀！〜",
    "status": "completed",
    "rating": 10,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/a1/ea/587454_1KdKJ.jpg",
    "description": "わたしはわたしを、好きになりたいから！\r\n陰キャでダメダメだった過去を捨て、高校デビューを果たした少女、 甘織れな子。\r\n運よくカーストトップの陽キャグループに\r\n入ったと思いきや、\r\n何とその中の二人から告白されちゃった！？\r\n\r\n学園のスパダリ・王塚真唯と、\r\n\r\n学園の天使・瀬名紫陽花さん。\r\n\r\nそんな二人の愛を受け止めるなんて、ムリムリ！\r\n\r\n返事に悩んでいたら、\r\n香穂ちゃんと一緒にコスプレイベント\r\nに出ることに。\r\n\r\n友達の頼みを聞くという形で、\r\n告白の返事を保留にするれな子。\r\n\r\nでもコスプレを通して香穂ちゃんの『好き』に触れたら、\r\nなにかが自分の中で\r\n変わるような気がして……！\r\n\r\nわたしが本当に欲しかったものって、なんだろう。\r\n\r\n果たして恋人はムリなのか！？\r\n\"ムリじゃなかった\"のか！？",
    "episodes": "5 episodes",
    "year": "2026",
    "genre": [
      "百合",
      "后宫",
      "校园"
    ],
    "studio": "Unknown",
    "link": "https://bgm.tv/subject/587454",
    "progress": 0,
    "totalEpisodes": 5,
    "startDate": "2026-01-01",
    "endDate": "2026-01-01"
  },
  {
    "title": "相反的你和我",
    "status": "completed",
    "rating": 10,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/71/50/525565_OxOv7.jpg",
    "description": "总是活力充沛，却又很在意周遭目光的女孩：铃木实优\r\n以及个性文静，却能清楚表达自己意见的男生：谷悠介\r\n\r\n本次故事将讲述这两人的生活点滴。铃木喜欢着谷，却一直无法鼓起勇气告白。直到某天，两人放学回家时走在同一条路上并牵起了手。借由该契机，两人相互倾诉对彼此的好感并开始了交往。同学们虽然感到讶异，但也都很支持两人的恋情。\r\n这部恋爱喜剧描写的，正是这对个性截然相反的两人，在彼此尊重之下慢慢加深互相的理解，并与朋友们一同度过的校园生活点滴。如此温暖的故事就此开幕！\r\n\r\n\r\n\r\n[简介原文]\r\nいつも元気いっぱいだけど周りの目を気にしてしまう女子・鈴木と、\r\n物静かだけど自分の意見をしっかり言える男子・谷。\r\n正反対な二人が誤解や勘違いをしながらもお互いを尊重し、\r\nゆっくりと理解を深めていく姿と、友人たちとの学校生活を描くラブコメディ。",
    "episodes": "12 episodes",
    "year": "2026",
    "genre": [
      "恋爱",
      "校园",
      "2026年1月"
    ],
    "studio": "「正反対な君と僕」製作委員会（松竹、電通、集英社、ABEMA、毎日放送）；高橋敏弘、新居祐介、瓶子吉久、古川雄太、柴田三穂子",
    "link": "https://bgm.tv/subject/525565",
    "progress": 0,
    "totalEpisodes": 12,
    "startDate": "2026-01-11",
    "endDate": "2026-01-11"
  },
  {
    "title": "超时空辉夜姬！",
    "status": "completed",
    "rating": 10,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/f6/0f/604826_2XWRN.jpg",
    "description": "在梦想与希望汇聚的虚拟空间<月夜见>，少女们相遇，以及离别的舞台，就此拉开帷幕——\r\n在近未来的时代，酒寄彩叶是就读于东京重点高中的17岁女高中生，她同时兼顾打工与学业，每天忙得不可开交。月见八千代是互联网虚拟空间<月夜见>的管理员兼超人气主播，彩叶平日透过观看八千代的直播放松身心。在这个任何人都能创造自己的分身，自由进行创作活动的<月夜见>里，彩叶一边支持着自己的偶像八千代，一边靠对战游戏零零散散赚点零用钱。\r\n某天放学回家的路上，彩叶发现了一根发出七彩光芒的RGB电线杆，在那里面竟然有一个可爱的婴儿。她放心不下把婴儿带回家，没想到对方转眼间迅速长大，长成了与彩叶年纪相仿的少女。\r\n「你……该不会是辉夜姬吧？」\r\n长大后的辉夜姬十分任性。在辉夜的请求（任性）下，彩叶开始帮她在月夜见开展主播活动。彩叶作为制作人创作音乐，辉夜作为主播负责演唱，两人也在合作中一点点拉近了距离。然而她们并不知道，一道不祥的阴影已经逼近了她们眼前，要将辉夜带回月亮——\r\n这是一个，还从未有人见过的「辉夜姬」的故事。\r\n\r\n\r\n\r\n\r\n[简介原文]\r\n夢と希望の集まる仮想空間、＜ツクヨミ＞。\r\n少女たちの出会い、\r\nそして別れのためのステージが、幕を開ける――\r\n\r\n今より少しだけ先の未来。\r\n都内の進学校に通う17歳の女子高生・酒寄彩葉は、\r\nバイトと学業の両立に励む超絶多忙な日々を送っていた。\r\n日々の癒やしは、インターネット上の仮想空間＜ツクヨミ＞の管理人兼大人気ライバー(配信者)・月見ヤチヨの配信を見ること。\r\n自分の分身を作り誰もが自由に創作活動を行う＜ツクヨミ＞で、彩葉はヤチヨの推し活をしつつ、バトルゲームで細々とお小遣い稼ぎをしていた。\r\n\r\nそんなある日の帰り道、彩葉は七色に光り輝くゲーミング電柱を見つける。\r\n中から出てきたのは、なんとも可愛らしい赤ちゃん。\r\n放っておけず連れ帰ると、赤ちゃんはみるみるうちに大きくなり、彩葉と同い年ぐらいの女の子に。\r\n「あなた、もしやかぐや姫なの？」\r\n\r\n大きくなったかぐや姫はわがまま放題。\r\nかぐやのお願い(わがまま)で彩葉は、ツクヨミでのライバー活動を手伝うことに。\r\n彩葉がプロデューサーとして音楽を作り、かぐやがライバーとして歌うことで、\r\n二人は少しずつ打ち解けていく。\r\nかぐやを月へと連れ戻す不吉な影が、すぐそこまで迫っているとも知らずに——\r\n\r\nこれは、まだ誰も見たことがない「かぐや姫」の物語。",
    "episodes": "1 episodes",
    "year": "2026",
    "genre": [
      "百合",
      "剧场版",
      "原创"
    ],
    "studio": "スタジオコロリド、STUDIO CHROMATO",
    "link": "https://bgm.tv/subject/604826",
    "progress": 0,
    "totalEpisodes": 1,
    "startDate": "2026-01-22",
    "endDate": "2026-01-22"
  },
  {
    "title": "葬送的芙莉莲 第二季",
    "status": "completed",
    "rating": 7.5,
    "cover": "https://lain.bgm.tv/r/800/pic/cover/l/0b/24/515759_qA1Zc.jpg",
    "description": "「流泪道别并不适合我们，因为下次再见时会很难为情。」\r\n在勇者欣梅尔一行人击败魔王后的世界中，与欣梅尔等人一同为世界带来和平、活了千年以上的精灵魔法使──芙莉莲。\r\n在面对寿命已尽的欣梅尔之死时，因落下的泪水与心中涌现的情感，踏上了「理解人类之心的旅程」。在旅途中，她与曾由过去伙伴海塔抚养长大的魔法使费伦，以及同为伙伴艾冉的弟子、战士修塔尔克结伴同行，一同朝向灵魂长眠之地前进。\r\n在旅程中，与各种人们相遇交流，并与狡诈的魔族与魔物展开战斗。有时平静温柔，有时无聊琐碎，有时激烈动荡，有时直击心扉……所有的一切、每一个瞬间，都一点一滴地堆叠成三人无可取代的珍贵回忆。而在这趟旅程的终点，究竟等待着他们的会是什么？\r\n魔法使资格测试结束后，他们三人将再度启程──\r\n\r\n\r\n\r\n[简介原文]\r\n「週刊少年サンデー」(小学館)で連載中、山田鐘人(原作)とアベツカサ(作画)による漫画『葬送のフリーレン』。\r\n勇者とそのパーティーによって魔王が倒された“その後”の世界を舞台に、\r\n勇者と共に魔王を打倒した千年以上生きる魔法使い・フリーレンと、彼女が新たに出会う人々の旅路が描かれていく。\r\n“魔王討伐後”という斬新な時系列で展開する胸に刺さるドラマやセリフ、魔法や剣による戦い、\r\n思わず笑ってしまうユーモアなど、キャラクターたちが織り成す物語で、多くの読者を獲得。\r\nこれまでに「マンガ大賞2021」大賞、「第25回手塚治虫文化賞」新生賞、\r\n「第69回(2023年度)小学館漫画賞」、「第48回講談社漫画賞」少年部門など数々の漫画賞を受賞。\r\nそして現在発売中のコミックスは累計部数3200万部を突破！漫画ファンの間で旋風を起こしている。\r\nそれを原作とするTVアニメは2023年9月から2024年3月まで放送され、\r\n国内外で幅広い、数多くのファンを獲得し、大きな反響を呼んだ。\r\nそしてこの度、待望の第2期が2026年1月より日本テレビ系で放送決定！\r\nフリーレンの「人の心を知る旅」が、再び始まる―。",
    "episodes": "10 episodes",
    "year": "2026",
    "genre": [
      "奇幻",
      "MADHouse",
      "漫画改"
    ],
    "studio": "「葬送のフリーレン」製作委員会【東宝（齋藤雅哉、尾村明洋、高野のぞみ、赤岩美紀、山田卓司）、小学館（島村英司）、日本テレビ（江成真二、大澤弘子、稲毛弘之）、MADHOUSE、小学館集英社プロダクション（藤澤佑介）、Aniplex、電通】",
    "link": "https://bgm.tv/subject/515759",
    "progress": 0,
    "totalEpisodes": 10,
    "startDate": "2026-01-16",
    "endDate": "2026-01-16"
  }
];

export default localAnimeList;
